//=============================================================================
// 行動管理クラス
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "renderer.h"
#include "behaviorManager.h"
#include "behavior.h"

//=============================================================================
// グローバル変数
//=============================================================================
CBehaviorManager* CBehaviorManager::Instance = NULL;	//インスタンス

//=============================================================================
// すべての解放
//=============================================================================
void CBehaviorManager::UninitAll(void)
{
	for each (auto list in m_List)
	{
		list->Uninit();
		delete list;
	}
	m_List.clear();
	m_ReleaseList.clear();
}

//=============================================================================
// すべての更新
//=============================================================================
void CBehaviorManager::UpdateAll(void)
{
	ReleaseList();
	for each (auto list in m_List)
	{
		list->Update();
	}
}

//=============================================================================
// 削除登録
//=============================================================================
void CBehaviorManager::Release(CBehavior* Behavior)
{
	m_ReleaseList.push_back(Behavior);
}

//=============================================================================
// 登録されたものを削除
//=============================================================================
void CBehaviorManager::ReleaseList(void)
{
	for each (auto list in m_ReleaseList)
	{
		for (auto itr = m_List.begin(); itr != m_List.end(); itr++)
		{
			if (list == (*itr))
			{
				itr = m_List.erase(itr);
				list->Uninit();
				delete list;
				break;
			}
		}
	}
	m_ReleaseList.clear();
}