//=============================================================================
// Model管理クラス
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "modelManager.h"
#include "model.h"

//=============================================================================
// グローバル変数
//=============================================================================
CModelManager* CModelManager::Instance = NULL;	//インスタンス

//=============================================================================
// 検索
//=============================================================================
CModel* CModelManager::Find(const string& FileName)
{
	if (m_Search.count(FileName) == 0) return NULL;
	return m_Search.find(FileName)->second;
}

//=============================================================================
// 生成
//=============================================================================
void CModelManager::Create(const string& FileName)
{
	if (m_Search.count(FileName) != 0)  return;
	CModel* model = CModel::Create(FileName);
	m_Scan.push_back(model);
	m_Search.insert(unordered_map<string, CModel*>::value_type(FileName, model));
}

//=============================================================================
// 全て解放
//=============================================================================
void CModelManager::ReleaseAll(void)
{
	for each ( auto list in m_Scan) delete list;
	m_Scan.clear();
	m_Search.clear();
}
