//=============================================================================
// Shader2Dクラス
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "shader2D.h"
#include "renderer.h"

//=============================================================================
// クラスの生成
//=============================================================================
CShader2D::CShader2D()
{
	
}

//=============================================================================
// クラスの破棄
//=============================================================================
CShader2D::~CShader2D()
{

}

//=============================================================================
// 描画開始
//=============================================================================
void CShader2D::Begin(int pass, LPDIRECT3DTEXTURE9& shadow, LPDIRECT3DTEXTURE9& position, LPDIRECT3DTEXTURE9& normal, LPDIRECT3DTEXTURE9& texture, LPDIRECT3DTEXTURE9& specular)
{
	m_Effect->SetTexture("g_ShadowMap", shadow);
	m_Effect->SetTexture("g_PositionMap", position);
	m_Effect->SetTexture("g_NormalMap", normal);
	m_Effect->SetTexture("g_DiffuseMap", texture);
	m_Effect->SetTexture("g_SpecularMap", specular);

	m_Effect->Begin(NULL, 0);	// テクニック開始 
	m_Effect->BeginPass(pass);		//パスの指定
}

//=============================================================================
// 描画終了
//=============================================================================
void CShader2D::End(void)
{
	m_Effect->EndPass();
	m_Effect->End();
}
