//=============================================================================
// Shader2Dクラス
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "shader3D.h"
#include "renderer.h"
#include "resource.h"
#include "texture.h"

//=============================================================================
// グローバル変数
//=============================================================================
LPDIRECT3DTEXTURE9 CShader3D::m_Texture = NULL;	//インスタンス
LPDIRECT3DTEXTURE9 CShader3D::m_Normal = NULL;	//インスタンス

//=============================================================================
// クラスの生成
//=============================================================================
CShader3D::CShader3D()
{
	m_Texture = *CResource::Get<CTexture>("TextureNone.jpg");
	m_Normal = *CResource::Get<CTexture>("NormalNone.jpg");
}

//=============================================================================
// クラスの破棄
//=============================================================================
CShader3D::~CShader3D()
{

}

//=============================================================================
// 描画開始
//=============================================================================
void CShader3D::Begin(int pass, D3DXMATRIX& world, D3DXMATRIX& view, D3DXMATRIX& proj, LPDIRECT3DTEXTURE9& texture, LPDIRECT3DTEXTURE9& normal)
{
	// エフェクト設定
	m_Effect->SetMatrix("g_world", &world);
	m_Effect->SetMatrix("g_view", &view);
	m_Effect->SetMatrix("g_proj", &proj);
	m_Effect->SetTexture("g_texture", texture);
	m_Effect->SetTexture("g_NormalTex", normal);

	m_Effect->Begin(NULL, 0);	// テクニック開始 
	m_Effect->BeginPass(pass);		//パスの指定
}

//=============================================================================
// 描画終了
//=============================================================================
void CShader3D::End(void)
{
	m_Effect->EndPass();
	m_Effect->End();
}
