//=============================================================================
// 操作カメラ
//=============================================================================
#pragma once

//=============================================================================
// インクルードファイル
//=============================================================================
#include "CameraController.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CComplianceCamera : public CCameraController
{
public:
	CComplianceCamera(CCamera* Camera, CObject* Object);
	~CComplianceCamera();

	void Init(D3DXVECTOR3 Pos);
	void Update(void);

private:
	D3DXVECTOR3 m_Pos;
	CObject* m_Object;
};