//=============================================================================
// ライフ
//=============================================================================
#pragma once

//=============================================================================
// インクルードファイル
//=============================================================================
#include "behavior.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CObject;
class CSceneAlphaMask;

//=============================================================================
// クラスの定義
//=============================================================================
class CLifeBehavior : public CBehavior
{
public:

	//コンストラクタ・デストラクタ
	//=============================================================================
	CLifeBehavior();
	~CLifeBehavior();

	//継承したすべてのオブジェクトに対して行う関数
	//=============================================================================
	void Init(float Life, string& tagName);
	void Uninit(void);
	void Update(void);

	//衝突
	//=============================================================================
	void CollisionTrigger(CObject* Object);		//衝突時
	void CollisionEnter(CObject* Object);		//衝突継続時
	void CollisionRelease(CObject* Object);		//衝突終了時

	//シェーダの検索、取得
	template<class Class, class _Class>
	static Class* Find(list<_Class> List)
	{
		for each (auto list in List)
		{
			if (typeid((*list)) != typeid(Class)) continue;
			return (Class*)list;
		}
	}

private:
	//変数
	//=============================================================================
	CSceneAlphaMask* m_AlphaMask;
	float m_LifeMax, m_Life;
	string m_TagName;
	bool m_Use;
	bool m_use;
};