//=============================================================================
// 操作カメラ
//=============================================================================
#pragma once

//=============================================================================
// インクルードファイル
//=============================================================================
#include "CameraController.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CPlayerCamera : public CCameraController
{
	public:
		CPlayerCamera(CCamera* Camera, CObject* Object);
		~CPlayerCamera();

		void Update ( void );

private:
	D3DXVECTOR3 m_MoveRot;		//回転量
	D3DXVECTOR2 m_MousePos;	//マウスの絶対座標
	D3DXVECTOR2 m_OldMousePos;	//1フレーム前のマウスの絶対座標
	float m_Distance;
	CObject* m_Object;
};