//=============================================================================
// ShaderAlphaMask3Dクラス
//=============================================================================
#pragma once

//=============================================================================
// インクルードファイル
//=============================================================================
#include "shader.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CShaderAlphaMask3D : public CShader
{
public:
	//コンストラクタ・デストラクタ
	//=============================================================================
	CShaderAlphaMask3D();
	~CShaderAlphaMask3D();

	//基本関数
	//=============================================================================
	void Begin(int pass, D3DXMATRIX& world, D3DXMATRIX& view, D3DXMATRIX& proj, LPDIRECT3DTEXTURE9& texture = m_Texture, LPDIRECT3DTEXTURE9& mask = m_Mask, float Criteria = 0.0f);	//描画開始
	void End(void);		//描画終了

private:
	//変数
	//=============================================================================
	static LPDIRECT3DTEXTURE9 m_Texture;
	static LPDIRECT3DTEXTURE9 m_Mask;
};