//=============================================================================
// Zテクスチャ生成レンダラー
//=============================================================================
#pragma once

//=============================================================================
// マクロ定義
//=============================================================================
#define RENDERTARGET_MAX (4)	//レンダーターゲットの最大数

//=============================================================================
// クラスの定義
//=============================================================================
class CZTexRenderer
{
public:
	//インスタンスを返す
	//=============================================================================
	static CZTexRenderer* GetInstance() { return Instance == NULL ? Instance = new CZTexRenderer() : Instance; }
	static void DestroyInstance() { Instance == NULL ? NULL : delete Instance; Instance = NULL; }

	//基本的な関数の宣言
	//=============================================================================
	void Init(void);
	void Uninit(void);
	void Begin(void);
	void End(void);

	//設定・取得関数
	//=============================================================================
	LPDIRECT3DTEXTURE9 GetTexture(void) { return m_Texture; }

private:
	//インスタンス
	//=============================================================================
	static CZTexRenderer* Instance;

	//コンストラクタ・デストラクタ
	//=============================================================================
	CZTexRenderer();
	~CZTexRenderer();

	//変数
	//=============================================================================
	LPDIRECT3DTEXTURE9 m_Texture;
	LPDIRECT3DSURFACE9 m_Surface;
	LPDIRECT3DSURFACE9 m_Zbuffer;
};